InformationRegisters/ТорговоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТорговоеОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Параметры торгового оборудования.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель торгового оборудования.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ, которой соответствует данное оборудование.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>Имя компьютера, к которому физически подключено данное устройство.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор подключаемого устройства.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТорговоеОборудование/Ext/ManagerModule.bsl
Функция ПолучитьПредставлние(Идентификатор, Ненайденное = Ложь) Экспорт
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Ненайденное = Ложь; Возврат Строка(Неопределено);
	КонецЕсли; 
	
	Запись = РегистрыСведений.ТорговоеОборудование.Получить(Новый Структура("Идентификатор", Идентификатор));
	
	Если Не ЗначениеЗаполнено(Запись.Компьютер) Тогда
		Ненайденное = Истина; Возврат НСтр("ru = 'Не найден'; uk = 'Не знайдено'");
	КонецЕсли; 
	
	Ненайденное = Ложь; Возврат Строка(Запись.Модель);
	
КонецФункции // ПолучитьПредставлние()
